; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v10 ?v8)
             (pred_10 ?v2 ?v3)
             (pred_2 ?v10 ?v3)
             (pred_6 ?v9 ?v10 )
	     (pred_3 ?v10)
             (pred_1 ?v7)
             (pred_4 ?v2)
             (pred_5 ?v3)
             (pred_12 ?v10)
             (pred_9 ?v2)
             (pred_11 ?v10)
             (pred_7 ))



(:action op_1
:parameters (?v5 ?v13 ?v12 ?v1)
:precondition (and (pred_1 ?v5) (pred_1 ?v13) (pred_4 ?v12) (pred_5 ?v1)
          (pred_8 ?v5 ?v13) (pred_10 ?v12 ?v1)
                   (pred_2 ?v13 ?v1) (pred_3 ?v5) 
                   (pred_12 ?v13) (pred_9 ?v12))
:effect (and  (pred_11 ?v13) (not (pred_12 ?v13))))


(:action op_2
:parameters (?v5 ?v6)
:precondition (and (pred_1 ?v5) (pred_1 ?v6)
               (pred_3 ?v5) (pred_8 ?v5 ?v6) (pred_11 ?v6))
:effect (and (pred_3 ?v6) (not (pred_3 ?v5))))

(:action op_5
:parameters (?v5 ?v12)
:precondition (and (pred_1 ?v5) (pred_4 ?v12) 
                  (pred_3 ?v5) (pred_6 ?v12 ?v5) (pred_7 ))
:effect (and (pred_9 ?v12)
   (not (pred_6 ?v12 ?v5)) (not (pred_7 ))))


(:action op_3
:parameters (?v5 ?v11 ?v4)
:precondition (and (pred_1 ?v5) (pred_4 ?v11) (pred_4 ?v4)
                  (pred_3 ?v5) (pred_9 ?v4) (pred_6 ?v11 ?v5))
:effect (and (pred_9 ?v11) (pred_6 ?v4 ?v5)
        (not (pred_9 ?v4)) (not (pred_6 ?v11 ?v5))))

(:action op_4
:parameters (?v5 ?v12)
:precondition (and (pred_1 ?v5) (pred_4 ?v12) 
                  (pred_3 ?v5) (pred_9 ?v12))
:effect (and (pred_7 ) (pred_6 ?v12 ?v5) (not (pred_9 ?v12)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_13 obj_03 obj_21 obj_12 obj_01 obj_04 obj_27 obj_09 obj_25 obj_20 obj_24 obj_28 obj_23 obj_08 obj_19 obj_22 obj_15 obj_26 obj_14 obj_30 obj_10 obj_05 obj_16 obj_29
    obj_07 obj_02
    obj_17 obj_18 obj_11
    )

    (:init
       (pred_7)

       (pred_1 obj_06)
       (pred_1 obj_13)
       (pred_1 obj_03)
       (pred_1 obj_21)
       (pred_1 obj_12)
       (pred_1 obj_01)
       (pred_1 obj_04)
       (pred_1 obj_27)
       (pred_1 obj_09)
       (pred_1 obj_25)
       (pred_1 obj_20)
       (pred_1 obj_24)
       (pred_1 obj_28)
       (pred_1 obj_23)
       (pred_1 obj_08)
       (pred_1 obj_19)
       (pred_1 obj_22)
       (pred_1 obj_15)
       (pred_1 obj_26)
       (pred_1 obj_14)
       (pred_1 obj_30)
       (pred_1 obj_10)
       (pred_1 obj_05)
       (pred_1 obj_16)
       (pred_1 obj_29)
       (pred_5 obj_07)
       (pred_5 obj_02)
       (pred_4 obj_17)
       (pred_4 obj_18)
       (pred_4 obj_11)

       (pred_8 obj_06 obj_01)
       (pred_8 obj_06 obj_13)
       (pred_8 obj_13 obj_04)
       (pred_8 obj_13 obj_03)
       (pred_8 obj_13 obj_06)
       (pred_8 obj_03 obj_27)
       (pred_8 obj_03 obj_21)
       (pred_8 obj_03 obj_13)
       (pred_8 obj_21 obj_09)
       (pred_8 obj_21 obj_12)
       (pred_8 obj_21 obj_03)
       (pred_8 obj_12 obj_25)
       (pred_8 obj_12 obj_21)
       (pred_8 obj_01 obj_20)
       (pred_8 obj_01 obj_04)
       (pred_8 obj_01 obj_06)
       (pred_8 obj_04 obj_24)
       (pred_8 obj_04 obj_27)
       (pred_8 obj_04 obj_13)
       (pred_8 obj_04 obj_01)
       (pred_8 obj_27 obj_28)
       (pred_8 obj_27 obj_09)
       (pred_8 obj_27 obj_03)
       (pred_8 obj_27 obj_04)
       (pred_8 obj_09 obj_23)
       (pred_8 obj_09 obj_25)
       (pred_8 obj_09 obj_21)
       (pred_8 obj_09 obj_27)
       (pred_8 obj_25 obj_08)
       (pred_8 obj_25 obj_12)
       (pred_8 obj_25 obj_09)
       (pred_8 obj_20 obj_19)
       (pred_8 obj_20 obj_24)
       (pred_8 obj_20 obj_01)
       (pred_8 obj_24 obj_22)
       (pred_8 obj_24 obj_28)
       (pred_8 obj_24 obj_04)
       (pred_8 obj_24 obj_20)
       (pred_8 obj_28 obj_15)
       (pred_8 obj_28 obj_23)
       (pred_8 obj_28 obj_27)
       (pred_8 obj_28 obj_24)
       (pred_8 obj_23 obj_26)
       (pred_8 obj_23 obj_08)
       (pred_8 obj_23 obj_09)
       (pred_8 obj_23 obj_28)
       (pred_8 obj_08 obj_14)
       (pred_8 obj_08 obj_25)
       (pred_8 obj_08 obj_23)
       (pred_8 obj_19 obj_30)
       (pred_8 obj_19 obj_22)
       (pred_8 obj_19 obj_20)
       (pred_8 obj_22 obj_10)
       (pred_8 obj_22 obj_15)
       (pred_8 obj_22 obj_24)
       (pred_8 obj_22 obj_19)
       (pred_8 obj_15 obj_05)
       (pred_8 obj_15 obj_26)
       (pred_8 obj_15 obj_28)
       (pred_8 obj_15 obj_22)
       (pred_8 obj_26 obj_16)
       (pred_8 obj_26 obj_14)
       (pred_8 obj_26 obj_23)
       (pred_8 obj_26 obj_15)
       (pred_8 obj_14 obj_29)
       (pred_8 obj_14 obj_08)
       (pred_8 obj_14 obj_26)
       (pred_8 obj_30 obj_10)
       (pred_8 obj_30 obj_19)
       (pred_8 obj_10 obj_05)
       (pred_8 obj_10 obj_22)
       (pred_8 obj_10 obj_30)
       (pred_8 obj_05 obj_16)
       (pred_8 obj_05 obj_15)
       (pred_8 obj_05 obj_10)
       (pred_8 obj_16 obj_29)
       (pred_8 obj_16 obj_26)
       (pred_8 obj_16 obj_05)
       (pred_8 obj_29 obj_14)
       (pred_8 obj_29 obj_16)
       (pred_12 obj_15)
       (pred_12 obj_06)
       (pred_12 obj_19)
       (pred_2  obj_15 obj_07)
       (pred_2  obj_06 obj_02)
       (pred_2  obj_19 obj_02)
       (pred_11 obj_13)
       (pred_11 obj_03)
       (pred_11 obj_21)
       (pred_11 obj_12)
       (pred_11 obj_01)
       (pred_11 obj_04)
       (pred_11 obj_27)
       (pred_11 obj_09)
       (pred_11 obj_25)
       (pred_11 obj_20)
       (pred_11 obj_24)
       (pred_11 obj_28)
       (pred_11 obj_23)
       (pred_11 obj_08)
       (pred_11 obj_22)
       (pred_11 obj_26)
       (pred_11 obj_14)
       (pred_11 obj_30)
       (pred_11 obj_10)
       (pred_11 obj_05)
       (pred_11 obj_16)
       (pred_11 obj_29)

       (pred_10  obj_17 obj_07)
       (pred_10  obj_18 obj_02)
       (pred_10  obj_11 obj_07)
       (pred_6 obj_17 obj_08)
       (pred_6 obj_18 obj_12)
       (pred_6 obj_11 obj_26)
       (pred_3 obj_24)
    )

    (:goal (and
       (pred_6 obj_17 obj_16)
       (pred_6 obj_18 obj_13)
       (pred_6 obj_11 obj_01)
    ))
(:constraints
  (always (not (pred_3 obj_03)))
)
)

; plan
1. (op_2 obj_24 obj_28)
   deleted: (pred_3 obj_24)
   added: (pred_3 obj_28)
   goals met: 0 of 3
2. (op_2 obj_28 obj_23)
   deleted: (pred_3 obj_28)
   added: (pred_3 obj_23)
   goals met: 0 of 3
3. (op_2 obj_23 obj_08)
   deleted: (pred_3 obj_23)
   added: (pred_3 obj_08)
   goals met: 0 of 3
4. (op_5 obj_08 obj_17)
   deleted: (pred_6 obj_17 obj_08) (pred_7)
   added: (pred_9 obj_17)
   goals met: 0 of 3
5. (op_2 obj_08 obj_23)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_23)
   goals met: 0 of 3
6. (op_2 obj_23 obj_26)
   deleted: (pred_3 obj_23)
   added: (pred_3 obj_26)
   goals met: 0 of 3
7. (op_2 obj_26 obj_16)
   deleted: (pred_3 obj_26)
   added: (pred_3 obj_16)
   goals met: 0 of 3
8. (op_4 obj_16 obj_17)
   deleted: (pred_9 obj_17)
   added: (pred_7) (pred_6 obj_17 obj_16)
   goals met: 1 of 3
9. (op_2 obj_16 obj_26)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_26)
   goals met: 1 of 3
10. (op_5 obj_26 obj_11)
   deleted: (pred_6 obj_11 obj_26) (pred_7)
   added: (pred_9 obj_11)
   goals met: 1 of 3
11. (op_2 obj_26 obj_23)
   deleted: (pred_3 obj_26)
   added: (pred_3 obj_23)
   goals met: 1 of 3
12. (op_2 obj_23 obj_09)
   deleted: (pred_3 obj_23)
   added: (pred_3 obj_09)
   goals met: 1 of 3
13. (op_2 obj_09 obj_21)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_21)
   goals met: 1 of 3
14. (op_4 obj_21 obj_11)
   deleted: (pred_9 obj_11)
   added: (pred_7) (pred_6 obj_11 obj_21)
   goals met: 1 of 3
15. (op_2 obj_21 obj_12)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_12)
   goals met: 1 of 3
16. (op_5 obj_12 obj_18)
   deleted: (pred_6 obj_18 obj_12) (pred_7)
   added: (pred_9 obj_18)
   goals met: 1 of 3
17. (op_2 obj_12 obj_21)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_21)
   goals met: 1 of 3
18. (op_2 obj_21 obj_09)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_09)
   goals met: 1 of 3
19. (op_2 obj_09 obj_27)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_27)
   goals met: 1 of 3
20. (op_2 obj_27 obj_04)
   deleted: (pred_3 obj_27)
   added: (pred_3 obj_04)
   goals met: 1 of 3
21. (op_2 obj_04 obj_13)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_13)
   goals met: 1 of 3
22. (op_4 obj_13 obj_18)
   deleted: (pred_9 obj_18)
   added: (pred_7) (pred_6 obj_18 obj_13)
   goals met: 2 of 3
23. (op_2 obj_13 obj_04)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_04)
   goals met: 2 of 3
24. (op_2 obj_04 obj_27)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_27)
   goals met: 2 of 3
25. (op_2 obj_27 obj_09)
   deleted: (pred_3 obj_27)
   added: (pred_3 obj_09)
   goals met: 2 of 3
26. (op_2 obj_09 obj_21)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_21)
   goals met: 2 of 3
27. (op_5 obj_21 obj_11)
   deleted: (pred_6 obj_11 obj_21) (pred_7)
   added: (pred_9 obj_11)
   goals met: 2 of 3
28. (op_2 obj_21 obj_09)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_09)
   goals met: 2 of 3
29. (op_2 obj_09 obj_27)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_27)
   goals met: 2 of 3
30. (op_2 obj_27 obj_04)
   deleted: (pred_3 obj_27)
   added: (pred_3 obj_04)
   goals met: 2 of 3
31. (op_2 obj_04 obj_01)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_01)
   goals met: 2 of 3
32. (op_4 obj_01 obj_11)
   deleted: (pred_9 obj_11)
   added: (pred_7) (pred_6 obj_11 obj_01)
   goals met: 3 of 3
